Repository: maximilian-hammerl/post-exporter
Catalog: RSHExporter/Resources/Localization/Resources.*.resx
Languages: de

source: Help
de: Hilfe

source: Send
de: Senden

source: Cancel
de: Abbrechen

# FeedbackTitleDefault
source: Thanks for your feedback!
de: Danke für dein Feedback!

# FeedbackTitleError
source: An error has occurred!
de: Ein Fehler ist aufgetreten!

# FeedbackDetailsDefault
source: Your feedback will be sent to Maxi! You can also, e.g., include links to images.
de: Dein Feedback wird an Maxi gesendet! Du kannst z.B. auch Links zu Bildern einfügen.

# FeedbackDetailsError
source: Something went wrong unexpectedly! The error has been reported with the ID {0}.
de: Etwas ist unerwartet schief gelaufen! Der Fehler wurde mit der ID {0} registriert.

# FeedbackResponseDefault
source: Please enter your feedback here:
de: Bitte gib dein Feedback hier ein:

# FeedbackResponseError
source: If possible, please enter more details what you did before the error occured here:
de: Wenn möglich, gib hier bitte mehr Details darüber an, was du getan hast, bevor der Fehler aufgetreten ist:

# FeedbackEmailDefault
source: If you want to possibly be contacted, enter your email address here:
de: Wenn du möglicherweise kontaktiert werden möchtest, gib hier deine E-Mail-Adresse ein:

# FeedbackEmailError
source: If you want to be notified by email when the error is fixed, enter your email address here:
de: Wenn du per E-Mail benachrichtigt werden möchtest, wenn der Fehler behoben ist, gib deine E-Mail-Adresse hier ein:

# LoginUsername
source: Your Username:
de: Dein Benutzername:

# LoginPassword
source: Your Password:
de: Dein Passwort:

# LoginExplanation
source: Login with your Rollenspielhimmel username and password to get started!
de: Melde dich mit deinem Rollenspielhimmel Benutzernamen und Passwort an um loszulegen!

# LoginLove
source: With ♡ by
de: Mit ♡ von

source: Login
de: Anmelden

source: Logout
de: Abmelden

source: To Export
de: Zum Export

# SelectGroups
source: 1. Your Groups:
de: 1. Deine Gruppen:

# SelectThreads
source: 2. Your Threads:
de: 2. Deine Beiträge:

# SelectThreadsOf
source: 2. Your Threads of {0}:
de: 2. Deine Beiträge von {0}:

# SelectSelectGroups
source: Select All Groups
de: Alle Gruppen auswählen

# SelectUnselectGroups
source: Unselect All Groups
de: Alle Gruppen abwählen

# SelectSelectThreads
source: Select All Threads
de: Alle Beiträge auswählen

# SelectUnselectThreads
source: Unselect All Threads
de: Alle Beiträge abwählen

source: Back
de: Zurück

# ExportSelected
source: 3. Selected Groups and Threads:
de: 3. Ausgewählte Gruppen und Beiträge:

source: Start Export
de: Export starten

# ExportFormat
source: Export File Format:
de: Export-Dateiformat:

source: Export Text Options:
de: Export-Text-Optionen:

source: Export Folder
de: Export-Ordner

# ExportChosenFolder
source: Export Folder:
de: Export-Ordner:

# OptionReserveOrder
source: Reverse the order of the posts (newest to oldest instead of oldest to newest)?
de: Die Reihenfolge der Beiträge umkehren (von der neuesten zur ältesten statt von der ältesten zur neuesten)?

# OptionDownloadImagesToOwnFolder
source: Download the images for each post into a separate folder?
de: Für jede Antwort die Bilder in einen eigenen Ordner herunterladen?

# OptionDownloadImages
source: Download the images of the posts?
de: Die Bilder der Antworten herunterladen?

# OptionIncludeImages
source: Export the posts with its images?
de: Die Antworten mit ihren Bildern exportieren?

# OptionDownloadToOwnFolder
source: Download the threads for each group into a separate folder?
de: Für jede Gruppe die Beiträge in eigene Ordner herunterladen?

# OptionIncludePageNumber
source: Include the page number?
de: Die Seitenzahl angeben?

# OptionIncludePostNumber
source: Include the post number?
de: Die Nummer der Antwort angeben?

# OptionIncludePostAuthor
source: Include the author of the posts?
de: Den Autor der Antworten angeben?

# OptionIncludePostPostedAt
source: Include when the post was posted?
de: Angeben, wann die Antwort gepostet wurde?

# OptionIncludeGroup
source: Include the name of the group at the top?
de: Den Namen der Gruppe am Anfang angeben?

# OptionIncludeThread
source: Include the name of the thread at the top?
de: Den Namen des Beitrags am Anfang angeben?

# OptionIncludeGroupAuthor
source: Also include the owner of the group?
de: Auch den Eigentümer der Gruppe angeben?

# OptionIncludeThreadAuthor
source: Also include the author of the thread?
de: Auch den Autor des Beitrags angeben?

# OptionIncludeGroupPostedAt
source: Also include when the group was created?
de: Auch angeben, wann die Gruppe erstellt wurde?

# OptionIncludeGroupUrl
source: Also include the URL to the group?
de: Auch die URL der Gruppe angeben?

# OptionIncludeThreadUrl
source: Also include the URL to the thread?
de: Auch die URL des Beitrags angeben?

# OptionIncludeThreadPostedAt
source: Also include when the thread was created?
de: Auch angeben, wann der Beitrag erstellt wurde?

# FileFormatDocx
source: Word File (.docx) - Contains text and (if selected) images
de: Word-Datei (.docx) - Enthält Text und (wenn ausgewählt) Bilder

# FileFormatHtml
source: HTML File (.html) - Contains formatted text and (if selected) images
de: HTML-Datei (.html) - Enthält formatierten Text und (wenn ausgewählt) Bilder

# FileFormatTxt
source: Text File (.txt) - Contains text only, no images and no formatting
de: Text-Datei (.txt) - Enthält nur Text, keine Formatierung und keine Bilder

# LoginSubtitle
source: Quickly and easily export and backup your Rollenspielhimmel groups, threads and posts!
de: Exportiere und sichere deine Rollenspielhimmel Gruppen, Beiträge und Antworten schnell und einfach!

# CancelExport
source: Click to cancel export
de: Klicken, um den Export abzubrechen

# WarningExportCancelled
source: The export was cancelled. Some files may have already been exported.
de: Der Export wurde abgebrochen. Manche Dateien wurden möglichbereits bereits exportiert.

# LoginAcceptLicense
source: I have read and accept the applicable notices and license terms
de: Ich habe die geltenden Hinweise und Lizenzbedingungen gelesen und akzeptiere sie

# LoginOpenLicense
source: (Click here to open the applicable notices and license terms)
de: (Klicke hier, um die geltenden Hinweise und Lizenzbedingungen zu öffnen)

# LoginMissingLicense
source: You have to accept the applicable notices and license terms before you can login
de: Bevor du dich einloggen kannst, musst du die geltenden Hinweise und Lizenzbedingungen akzeptieren

# LoginAcceptSentry
source: I allow anonymous data to be collected for application monitoring and error tracking using Sentry.
de: Ich erlaube, dass anonyme Daten zum Monitoring und Fehlerverfolgung mittels Sentry gesammelt werden.

# LoginOpenSentry
source: Click here to learn more out Sentry
de: Klicke hier, um mehr über Sentry zu erfahren

# ErrorNoSentry
source: Sentry is used to send your feedback. Unfortunately, because you have not agreed to the use of Sentry, your feedback cannot be collected.
de: Sentry wird verwendet, um dein Feedback zu senden. Da du der Verwendung von Sentry nicht zugestimmt hast, kann dein Feedback leider nicht erfasst werden.

# HelpStep
source: Step {0} of {1}
de: Schritt {0} von {1}

source: Error
de: Fehler

source: Warning
de: Warnung

source: Question
de: Frage

# HelpLoginStep1
source: First enter the username and password you use on Rollenspielhimmel to log in.
de: Gib zuerst den Benutzernamen und das Passwort ein, die du bei Rollenspielhimmel verwendest, um dich einzuloggen.

# HelpLoginStep2
source: Then click here to log in and continue with selecting your groups and threads.
de: Klicke dann hier, um dich einzuloggen und mit dem Auswählen deiner Gruppen und Beiträge fortzufahren.

# HelpSelectStep1
source: Start by selecting the groups. Clicking on a group will load all threads of it.
de: Beginne damit, die Gruppen auszuwählen. Wenn du auf eine Gruppe klickst, werden alle Beiträge dieser Gruppe geladen.

# HelpSelectStep2
source: Then, for each group, select the posts you want to export.
de: Wähle dann für jede Gruppe die Beiträge aus, die du exportieren möchtest.

# HelpSelectStep3
source: Here you can select und unselect all groups and/or threads.
de: Du kannst hier alle Gruppen an- und abwählen...

# HelpSelectStep4
source: You can open a group or thread in the browser by clicking on the small icon to the right of the group or thread name.
de: ...und alle Beiträge hier.

# HelpSelectStep5
source: If you have selected all groups and threads, continue to export by clicking here. (You can also go back again without losing any of your changes.)
de: Du kannst eine Gruppe oder einen Beitrag im Browser öffnen, indem du auf das kleine Symbol rechts neben dem Namen der Gruppe oder des Beitrags klickst.

# HelpExportStep1
source: First check whether you have selected all groups and threads you want to export.
de: Überprüfe zunächst, ob du alle Gruppen und Beiträge ausgewählt hast, die du exportieren möchtest.

# HelpExportStep2
source: You can always go back to selecting groups and threads. All of your changes are automatically saved.
de: Du kannst jederzeit zurückgehen, um Gruppen und Themen auszuwählen. Alle deine Änderungen werden automatisch gespeichert.

# HelpExportStep3
source: Start the export process by choosing the folder the files should be saved in. Files will be overwritten, if they already exist.
de: Beginne den Exportvorgang, indem du den Ordner auswählst, in dem die Dateien gespeichert werden sollen. Dateien werden überschrieben, wenn sie bereits existieren.

# HelpExportStep4
source: Then choose the format (or multiple formats) of the exported files.
de: Wähle dann das Format (oder mehrere Formate) für die exportierten Dateien.

# HelpExportStep5
source: Configure how you want the groups and threads to be exported.
de: Lege fest, wie die Gruppen und Beiträge exportiert werden sollen.

# HelpExportStep8
source: Finally, you can start the export here. (Exporting can take a while, especially with a slow internet connection.) You can also cancel the export at any time.
de: Abschließend kannst du den Export hier starten. (Der Export kann eine Weile dauern, besonders bei einer langsamen Internetverbindung.) Du kannst den Export auch jederzeit abbrechen.

# ExportOtherOptions
source: Other Export Options:
de: Weitere Export-Optionen:

# LicenseTitle
source: Applicable Notes and License Terms
de: Geltende Hinweise und Lizenzbedingungen

# LicenseText
source: MIT License Copyright (c) 2022 Maximilian Hammerl Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
de: MIT-Lizenz Copyright (c) 2022 Maximilian Hammerl Jedem, der eine Kopie dieser Software und der zugehörigen Dokumentationsdateien (die „Software“) erhält, wird hiermit kostenlos die Erlaubnis erteilt, ohne Einschränkung mit der Software zu handeln, einschließlich und ohne Einschränkung der Rechte zur Nutzung, zum Kopieren, Ändern, Zusammenführen, Veröffentlichen, Verteilen, Unterlizenzieren und/oder Verkaufen von Kopien der Software, und Personen, denen die Software zur Verfügung gestellt wird, dies unter den folgenden Bedingungen zu gestatten: Der obige Urheberrechtshinweis und dieser Genehmigungshinweis müssen in allen Kopien oder wesentlichen Teilen der Software enthalten sein. DIE SOFTWARE WIRD OHNE MÄNGELGEWÄHR UND OHNE JEGLICHE AUSDRÜCKLICHE ODER STILLSCHWEIGENDE GEWÄHRLEISTUNG, EINSCHLIEẞLICH, ABER NICHT BESCHRÄNKT AUF DIE GEWÄHRLEISTUNG DER MARKTGÄNGIGKEIT, DER EIGNUNG FÜR EINEN BESTIMMTEN ZWECK UND DER NICHTVERLETZUNG VON RECHTEN DRITTER, ZUR VERFÜGUNG GESTELLT. DIE AUTOREN ODER URHEBERRECHTSINHABER SIND IN KEINEM FALL HAFTBAR FÜR ANSPRÜCHE, SCHÄDEN ODER ANDERE VERPFLICHTUNGEN, OB IN EINER VERTRAGS- ODER HAFTUNGSKLAGE, EINER UNERLAUBTEN HANDLUNG ODER ANDERWEITIG, DIE SICH AUS ODER IN VERBINDUNG MIT DER SOFTWARE ODER DER NUTZUNG ODER ANDEREN GESCHÄFTEN MIT DER SOFTWARE ERGEBEN.

source: Decline
de: Ablehnen

source: Accept
de: Akzeptieren

source: Continue
de: Weiter

# WelcomeTitle
source: Thanks for using the RSH Exporter
de: Danke, dass du den RSH Exporter benutzt

# WelcomeText
source: Just a heads-up before you jump in: The program is still in early development. You might experience some bugs and some features are still being developed. Make sure that you are using the most recent version! If you need help, most pages have a "Help" button at the top which explains the current page in detail. There is also a "Feedback" button for your ideas, suggestions and general feedback which I am always happy to receive. To simplify finding and fixing possible bugs, this program uses Sentry, a application monitoring and error tracking software. Therefore, please consider allowing Sentry to track errors!
de: Nur eine kleine Vorwarnung, bevor du loslegst: Das Programm befindet sich noch in einer frühen Entwicklungsphase. Es kann sein, dass du auf einige Fehler stößt und einige Funktionen sind noch in der Entwicklung. Vergewissere dich, dass du die aktuellste Version verwendest! Wenn du Hilfe benötigst, findest du auf den meisten Seiten oben einen "Hilfe"-Button, der die aktuelle Seite im Detail erklärt. Es gibt auch einen "Feedback"-Button für deine Ideen, Vorschläge und allgemeines Feedback, über das ich mich immer freue. Um das Finden und Beheben möglicher Fehler zu vereinfachen, verwendet dieses Programm Sentry, eine Software zum Monitoring und Fehlerverfolgung. Es wäre daher super, wenn du Sentry erlaubst, Fehler zu verfolgen!

# HelpWelcomeStep6
source: And if you are ready, click here to continue to the login.
de: Und wenn du bereit bist, klicke hier, um zur Anmeldung zu gelangen.

# HelpWelcomeStep4
source: Here you can see the current version number of the program.
de: Hier kannst du die aktuelle Versionsnummer des Programms sehen.

# HelpWelcomeStep5
source: And here the team which helps me with designing and programming.
de: Und hier das Team, das mir bei der Gestaltung und Programmierung hilft.

# HelpWelcomeStep3
source: You can click here to go to the repository of the program.
de: Du kannst hier klicken, um zum Repository des Programms zu gelangen.

# HelpWelcomeStep1
source: Hi! These help dialogs will hopefully help you with learning how to use this program. Most pages have a help dialog which explains how the current page works.
de: Hallo! Diese Hilfedialoge helfen dir hoffentlich dabei, zu lernen, wie du dieses Programm benutzen kannst. Die meisten Seiten haben einen Hilfedialog, der erklärt, wie die aktuelle Seite funktioniert.

# HelpWelcomeStep2
source: Allowing Sentry to collect anonymous data when an error occurs helps me immensely with fixing these errors.
de: Wenn du Sentry erlaubst, anonyme Daten zu sammeln, wenn ein Fehler auftritt, hilft mir das ungemein bei der Behebung dieser Fehler.

# TemplateImageAt
source: Image at
de: Bild unter

# TemplateAt
source: at
de: unter

# TemplatePage
source: Page
de: Seite

# TemplateFrom
source: from
de: von

# TemplateOn
source: on
de: am

# ErrorTemplates
source: There is a problem with your {0} templates!
de: Es gibt ein Problem mit deinen {0} Templates!

# ErrorMissingPlaceholder
source: the placeholder {0} is missing
de: der Platzhalter {0} fehlt

# ErrorMissingPlaceholders
source: the placeholders {0} are missing
de: die Platzhalter {0} fehlen

# ErrorUnusedPlaceholder
source: the placeholder {0} is unused
de: der Platzhalter {0} ist unbenutzt

# ErrorUnusedPlaceholders
source: the placeholders {0} are unused
de: die Platzhalter {0} sind unbenutzt

source: and
de: und

# PlaceholderTotalPostNumber
source: [TotalPostNumber]
de: [GesamteZahlAntworten]

# PlaceholderCurrentPostNumber
source: [CurrentPostNumber]
de: [AktuelleZahlAntworten]

# PlaceholderGroupAuthor
source: [GroupOwner]
de: [GruppeEigentümer]

# PlaceholderGroupPostedAt
source: [GroupCreatedAt]
de: [GruppeErstelltAm]

# PlaceholderGroupTitle
source: [GroupName]
de: [GruppeName]

# PlaceholderGroupUrl
source: [GroupUrl]
de: [GruppeUrl]

# PlaceholderPostAuthor
source: [PostAuthor]
de: [AntwortAutor]

# PlaceholderPostPostedAt
source: [PostPostedAt]
de: [AntwortGepostetAm]

# PlaceholderPosts
source: [Posts]
de: [Antworten]

# PlaceholderPostText
source: [PostText]
de: [AntwortText]

# PlaceholderThreadAuthor
source: [ThreadAuthor]
de: [BeitragAutor]

# PlaceholderThreadPostedAt
source: [ThreadCreatedAt]
de: [BeitragErstelltAm]

# PlaceholderThreadTitle
source: [ThreadName]
de: [BeitragName]

# PlaceholderThreadUrl
source: [ThreadUrl]
de: [BeitragUrl]

source: Save
de: Speichern

# ExportAdvancedOptions
source: Export Options for Advanced Users:
de: Export-Optionen für fortgeschrittene Benutzer:

# OptionUseCustomTemplates
source: Use Custom Templates
de: Benutzerdefinierte Templates verwenden

source: Update Templates
de: Templates updaten

source: Reset:
de: Zurücksetzen:

# TemplatesTitle
source: Custom Templates
de: Benutzerdefinierte Templates

# TemplatesDetails1
source: The text file export uses the text templates. The HTML file and Word file export use the HTML templates. The head templates stand for the header of the export of a thread and the body templates for the answers of the thread. At the placeholder
de: Der Text-Datei Export verwendet die Text Templates. Der HTML-Datei und Word-Datei Export verwenden die HTML Templates. Die Head-Templates stehen für die Kopfzeile des Exports eines Beitrags und die Body-Templates für die Antworten des Beitrags. Beim Platzhalter

# TemplatesPlaceholders
source: Available Placeholders
de: Verfügbare Platzhalter

# TemplatesRequiredPlaceholders
source: Required:
de: Erforderlich:

# TemplatesHtmlHead
source: Head-Template for Html
de: Head-Template für Html

# TemplatesHtmlBody
source: Body-Template for Html
de: Body-Template für Html

# TemplatesTextBody
source: Body-Template for Text
de: Body-Template für Text

# TemplatesTextHead
source: Head-Template for Text
de: Head-Template für Text

# ErrorExportFailed
source: There was a problem while exporting! The thread(s) {0} could not be successfully exported!
de: Es gab ein Problem beim Exportieren! Der Beitrag/die Beiträge {0} konnte(n) nicht erfolgreich exportiert werden!

# HelpExportStep6
source: Instead of using the checkboxes of the previous step, advanced users can also edit the export templates directly. This required basic knowledge of HTML.
de: Anstatt die Checkboxes des vorherigen Schritts zu verwenden, können fortgeschrittene Benutzer die Export-Templates auch direkt bearbeiten. Dafür sind Grundkenntnisse in HTML erforderlich.

# HelpExportStep7
source: You can also configure where the files will be saved, whether all files should be in one folder or whether every group and/or all images of a thread should have their separate folder.
de: Du kannst auch konfigurieren, wo die Dateien gespeichert werden sollen, ob alle Dateien in einem Ordner sein sollen oder ob jede Gruppe und/oder alle Bilder eines Beitrags einen eigenen Ordner haben sollen.

# TemplatesDetails2
source: of the head templates the body templates for the answers are inserted when exporting. The default templates are based on the current export text options. Only if a text option is selected, the placeholder is also displayed in the default template.
de: bei den Head-Templates werden beim Exportieren die Body-Templates für die Antworten eingefügt. Die Standard-Templates basieren auf den aktuellen Export-Text-Optionen. Nur wenn eine Text-Option ausgewählt wurde, wird auch der Platzhalder im Standard-Template angezeigt.

# ResetAllPlaceholders
source: With All Placeholders
de: Mit allen Platzhaltern

# ResetCurrentPlaceholders
source: With Current Placeholders
de: Mit aktuellen Platzhaltern
